<template>
    <section class="home">
        <section class="welcome">
            <div class="welcome__wrapper">
                <img class="welcome__banner" src="../assets/media/banner.jpeg" alt="">
                <div class="welcome__container">
                    <div class="welcome__row">
                        <h1 class="welcome__title">Добро пожаловать в Old Tried Partner!</h1>
                        <p class="welcome__text">
                            У нас Вы можете приобрести автокосметику по низким ценам!
                            Наши товары довольно популярны в Краснодаре и Краснодарском крае.
                            Продукция Old Tried Partner подходит как для автомоек, так и для домашнего использования.
                            Мы производим автокосметику с 2019 года, на доверяют многие Краснодарские компаниии.
                        </p>
                        <h1 class="welcome__title"> Автошампуни Drive</h1>
                            <p class="welcome__text">
                                Drive – высокоэффективное концентрированные щелочное средство для бесконтактной мойки любого автотранспорта.
                                Используется для устранения любых загрязнений с поверхности кузовов и двигателей.
                                Способ применения Drive:
                                в случае сильного загрязнения предварительно сбить грязь струей воды при помощи аппарата высокого давления.
                                С использованием пеногенератора рекомендовано разведение концентрата 1:60-1:50 (типа «Кёрхер»).
                                В зависимости от условий мойки разведение может варьироваться.
                                С использованием пенокомплекта разведение концентрата 1:4.
                                Нанести средство для бесконтактной мойки автомобилей на поверхность и после 3-4 минут активации смыть из аппарата высокого давления.
                                После работы вымыть руки. Не допускать высыхания на поверхности автомобиля. 
                            </p>
                            <h1 class="welcome__title">Средства для очистки резины</h1>
                            <p class="welcome__text">
                                Концентрированное средство для очистки и чернения шин. 
                                Бережно очищает поверхность покрышек до естественного состояния, восстанавливает цвет, защищает от воздействия атмосферных явлений. 
                                Способ применения: Перед применением разбавить водой в соотношении 300-500 гр. На 1 литр воды. 
                                Нанести на обрабатываемую поверхность с помощью поролоновой губки или распылителя. 
                                Равномерно растереть по поверхности.
                                Состав: Специально очищенная вода, композиция поверхностно-активных веществ, эмульгатор, краситель. 
                            </p>
                            <h1 class="welcome__title">Воск – осушитель для автомоек</h1>
                            <p class="welcome__text">
                                Концентрированный воск-осушитель обеспечивает быстрое высыхание автомобиля после мойки и создает на поверхности водоотталкивающее защитное покрытие. 
                                Способ применения: Разбавить водой в соотношении:20-50 гр. На 1 литр воды. 
                                Нанести разбавленный воск на предварительно промытую поверхность автомобиля из распылителя. 
                                Излишки воска смыть с поверхности чистой водой из шланга. 
                                При необходимости удалить остатки воды с помощью искусственной замши. 
                                Состав: Вода, эмульсионный воск, консервант, краситель. 
                            </p>
                    </div>
                </div>
            </div>
        </section>
            <footerComponent></footerComponent>
    </section>
</template>

<style lang="scss">
    @import "../assets/styles/helpers/_grid";
    .welcome {
        margin-top: 20px;
        min-height: calc(100vh - 200px);
        &__container {
            @include container();
            margin-top: 55px;
            margin-bottom: 55px;
        }

        &__row {
            @include row-flex();
        }
      &__title{
        width: 100%;
        margin-top: 10px;
        text-align: left;
      }
      &__title:first-child{
        margin-top: 0;
      }
      &__text{
          text-align: justify;
          margin-top: 10px;
      }
      &__banner{
          margin-top: 55px;
          width: 100%;
          height: auto;
      }
    }
</style>

<script>
    import footerComponent from '../components/footer.vue';
    export default {
        metaInfo: {
        title: 'Old Tried Partner',
        titleTemplate: "%s - Главная"
        },
        name: 'Home',
        components: {
            footerComponent
        }
    }
</script>
